app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kassandre"], ["email", "testtest@test.com"], ["created_at", 2016-12-07 15:51:55 UTC], ["updated_at", 2016-12-07 15:51:55 UTC]]
---
  def create
    @user = User.new(user_params) #create new user with params in private method
    if @user.save #return true or false